import React, { Component } from 'react';
import "../../../node_modules/video-react/dist/video-react.css";
import { Player } from 'video-react';
import { unstable_batchedUpdates } from 'react-redux/lib/utils/reactBatchedUpdates';

export default class About extends Component {
  render() {
    return (
      <div>
        <header className=" qwewq py-5 bg-image-full">
        </header>

        <section className="py-5">
          <div className="container persianDirection font3">
            <h1 className='floattt'>در باره ی رویداد</h1>
            
            <p className='persianDirection floattt'>هــرســال،شــاخهدانشــجویَیACMدانشــگاهتهــران،رویـدادی بـرای آشـنایی ورودی هـا بـا ایـن شـاخه، محیـط
دانشـکده و دانشـجوهای سـال بالایـی برگـزار مـی کنـد.
کمــک بــه دانشــجوهای ســال اول بــرای تجربــه ی کار گروهــی، از اهــداف مهــم برگــزاری ایــن رویــداد اســت. بـا اینکـه هـدف ایـن رویـداد ثابـت بـوده امـا نحـوه ی برگـزاری آن تغییـرات زیـادی کـرده اسـت. سـال گذشـته، بـرای اولیـن بـار، ایـن رویـداد بـا عنـوان Maze برگزار شـد. شـاخه دانشـجویی ACM قصـد دارد کـه امسـال دومیـن دوره Maze را در آبــان مــاه بــرای همــه ی ورودی هــای جدیـد دانشـکده ی بـرق و کامپیوتـر برگـزار کنـد. Maze؟ Maze یـک مسـابقه معمایـی اسـت کـه بـه پیـش نیـازی در زمینـه کامپیوتـر و برنامـه نویسـی نیـاز نـدارد و تنهـا خلاقیـت شـما را بـه چالـش مـی کشـد. در ایـن مسـابقه شرکــت کننــده هــا در قالــب تیــم بــا هــم مســابقه مــی دهنـد. هـر تیـم دارای یـک یـا دو راهنـما اسـت کـه در جریـان مسـابقه بـه تیـم کمـک مـی کننـد. هـر تیـم بـا اســتفاده از نقشــه و هشــدارهایی کــه در مســیر وجــود دارد، بــه پرســش هــای مســابقه مــی رســند و ســپس بــه آن هـا پاسـخ مـی دهنـد. گروهـی کـه زودتـر از بقیـه بـه همــه پرســش هــا پاســخ درســت بدهــد، برنــده مســابقه
خواهـد بـود.</p>
          </div>
        </section>


        <section class=" ertre py-5 bg-image-full">
          <div style={{height: '200px'}}></div>
        </section>
        <section class="py-5">
        <section class="py-5">
          <div class="container persianDirection font3">
            <h1 className='floattt'>روند مسابقه</h1>
            <p className='floattt'>در این مسابقه، شرکت کننده ها به گروه های چند نفره تقسیم می شوند و برای هر گروه یک یا دو تا راهنما تعیین می شود. در این مسابقه باید به تعدادی سوال معمای پاسخ دهید. برای هر گروه مسیر جداگانه ای از گروه های دیگر در نظر گرفته شده که در آن مسیر QR Code هایی وجود دارد که با اسکن آن ها، سوالات برای آن ها باز می شود. هر گروه با استفاده از نقشه و هشدارهایی که برای پیدا کردن مسیر به آن ها داده می شود؛ باید بتواند مسیر خود را بیابد. پس از حل درست هر سوال، باید مکان QR Code دیگر را پیدا کنند. در نهایت، گروهی که زودتر از سایر گروه ها به همه ی سوالات پاسخ درست بدهد، برنده مسابقه خواهد بود.</p>
          </div>
        </section>
        <header class=" ded py-5 bg-image-full">
        </header>

        <section class="py-5">
          <div class="container persianDirection font3">
            <h1 className='floattt'>نظر بچه های ٩٧؟</h1>
            
            <p className='persianDirection floattt'>اولیـن بـاری بـود کـه احسـاس کـردم بالاخره دانشـجو شـده ام. شـاید یکـی از بهتریـن روزهـای تـرم یـک بـود. شـاید کـه نـه، قطعـا. اولیـن روزی بـود کـه نسـبت بـه دانشـگاه احسـاس تعلـق کـردم. بـرای Maze، کـه نمـی دانسـتم چیسـت، یـک روز زودتـر از شهرســتان بــه تهــران آمــدم و الان خیلــی خــوش حــال هسـتم کـه آن را از دسـت نـدادم. مـی تـوان گفـت بهتریـن آغـاز دانشـکده بـود. بـه عبارتـی اولیـن محیـط صمیمـی دانشـکده اسـت و سـایت نشـینی هـای طولانـی و کنـار هـم بـودن را در یـک روز بـه صـورت کوتـاه تجربـه مـی کنیـد. - همین که خوش گذشت کافیست. نیست؟ - اول اینکــه خیلــی در آشــنایی و صمیمــی شــدن بچـه هـا تاثیـر داشـت. بـه عنـوان تیـم قهرمـان دوره قبـل، شــدیدا توصیــه مــی کنــم. - افـراد جدیـدی شـناختم. از کار تیمـی بـه شـدت لــذت بــردم. خــودم را بــه بهتریــن حالــت بــه چالــش
کشــید م .</p>
          </div>
        </section>
        </section>
      </div>
    )
  }
}
